<a href="https://colab.research.google.com/github/zeruel91/DataAnalysis/blob/main/Bond_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd
customer_master = pd.read_csv('customer_master.csv')
item_master = pd.read_csv('item_master.csv')
transaction_1= pd.read_csv('transaction_1.csv')
transaction_2= pd.read_csv('transaction_1.csv')
transaction_detail_1= pd.read_csv('transaction_detail_1.csv')
transaction_detail_2= pd.read_csv('transaction_detail_2.csv')

# tr1 tr2 세로로
#tr dt1,dt2 가로로 결합.

In [7]:
transaction = pd.concat([transaction_1,transaction_2],ignore_index = True)
# transaction_1.info()
# transaction_2.info()
transaction.info()
#concat => 세로로 결합.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  10000 non-null  object
 1   price           10000 non-null  int64
 2   payment_date    10000 non-null  object
 3   customer_id     10000 non-null  object
dtypes: int64(1), object(3)
memory usage: 312.6+ KB

In [8]:
len(transaction_1) + len(transaction_2)== len(transaction) #검산

True

In [9]:
transaction_detail = pd.concat([transaction_detail_1,transaction_detail_2],ignore_index = True)

In [31]:
#pd.merge -> 가로로 결합.
join_data = pd.merge(transaction_detail,transaction[["transaction_id","payment_date","customer_id"]],
                     on="transaction_id",how = 'left')

In [32]:
join_data.head()

   detail_id transaction_id item_id  quantity         payment_date customer_id
0          0    T0000000113    S005         1  2019-02-01 01:36:57    PL563502
1          0    T0000000113    S005         1  2019-02-01 01:36:57    PL563502
2          1    T0000000114    S001         1  2019-02-01 01:37:23    HD678019
3          1    T0000000114    S001         1  2019-02-01 01:37:23    HD678019
4          2    T0000000115    S003         1  2019-02-01 02:34:19    HD298120

In [33]:
transaction_detail.head()

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1
3          3    T0000000116    S005         1
4          4    T0000000117    S002         2

In [34]:
join_data = pd.merge(join_data, customer_master,on="customer_id",how = 'left')

In [35]:
join_data = pd.merge(join_data, item_master,on="item_id",how = 'left')
join_data.head()

   detail_id transaction_id item_id  ...   pref item_name item_price
0          0    T0000000113    S005  ...  대전광역시      PC-E     210000
1          0    T0000000113    S005  ...  대전광역시      PC-E     210000
2          1    T0000000114    S001  ...  서울특별시      PC-A      50000
3          1    T0000000114    S001  ...  서울특별시      PC-A      50000
4          2    T0000000115    S003  ...  광주광역시      PC-C     120000

[5 rows x 15 columns]

In [37]:
#column 생성
join_data["price"] = join_data["quantity"] * join_data["item_price"]

In [20]:
join_data.head

   detail_id transaction_id item_id  ...  item_name_y item_price_y   price
0          0    T0000000113    S005  ...         PC-E       210000  210000
1          0    T0000000113    S005  ...         PC-E       210000  210000
2          1    T0000000114    S001  ...         PC-A        50000   50000
3          1    T0000000114    S001  ...         PC-A        50000   50000
4          2    T0000000115    S003  ...         PC-C       120000  120000

[5 rows x 18 columns]